app/controllers/admin_controller.rb

  def index
  	if session["admin"] != nil && session["admin"] != false
  		@attendances = Attendance.order('id DESC').limit(30)
---
SELECT "attendances".* FROM "attendances" ORDER BY id DESC LIMIT 30