app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances" ORDER BY id DESC LIMIT 30
---
  def index
  	@attendances = Attendance.order('id DESC').limit(30)

SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
  	@attendance = Attendance.find(params[:id])

INSERT INTO "attendances" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Oct 2012 16:10:46 UTC +00:00], ["name", "Tiago Gomes"], ["password", "ApAsSwOrD"], ["updated_at", Wed, 24 Oct 2012 16:10:46 UTC +00:00]]
SELECT "attendances".* FROM "attendances" ORDER BY id DESC LIMIT 30
---
  def create
    @attendance = Attendance.new(params[:attendance])
    if @attendance.save
      #redirect_to attendance_path(@attendance)
      redirect_to root_path
    else
      @attendances = Attendance.order('id DESC').limit(30)

DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 2]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", "2"]]
---
  def destroy
  	Attendance.find(params[:id]).destroy