app/views/attendances/create.js.erb

INSERT INTO "attendances" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Nov 2012 16:06:48 UTC +00:00], ["name", "hello test"], ["password", "test"], ["updated_at", Mon, 12 Nov 2012 16:06:48 UTC +00:00]]
---
<% else %>
	$('table.presence tr.header').after("<tr class='today'><td><%= escape_javascript(@attendance.name) %></td><td> <%=  escape_javascript(@attendance.created_at.localtime.strftime('%d-%m-%Y às %H:%M:%S')) %> </td></tr>");